Repository: TashaSkyUp/opi0setup
Catalog: LFS/grep-2.5.3/po/*.po
Languages: cs, ro

source: Memory exhausted
cs: Pame» vyèerpána
ro: Memorie plinã

source: Unbalanced [
cs: Lichý poèet [
ro: [ fãrã pereche

source: Unfinished \ escape
cs: Za \ chybí znak
ro: \ escape neterminat

source: unfinished repeat count
cs: neukonèený zápis poètu opakování
ro: numãrare repetatã neterminatã

source: malformed repeat count
cs: deformovaný zápis poètu opakování
ro: numãrare repetatã malformatã

source: Unbalanced (
cs: Lichý poèet (
ro: ( fãrã pereche

source: No syntax specified
cs: Syntaxe není urèena
ro: Nu s-a specificat sintaxa

source: Unbalanced )
cs: Lichý poèet )
ro: ) fãra pereche

source: out of memory
cs: nedostatek volné pamìti
ro: memorie plinã

source: memory exhausted
cs: pamì» vyèerpána
ro: memorie plinã

source: invalid context length argument
cs: neplatný argument délky kontextu
ro: parametru lungime context invalid

source: input is too large to count
cs: poèet vstupních øádkù nelze spoèítat (je jich hodnì)
ro: intrarea(input) este prea mare pentru numãrare

source: writing output
cs: zapisuje se výstup
ro: scriere output

source: Binary file %s matches
cs: Binární soubor %s odpovídá
ro: Fiºierul binar %s corespunde

source: (standard input)
cs: (standardní vstup)
ro: (intrare standard)

source: warning: %s: %s
cs: varování: %s: %s
ro: avertisment: %s: %s

source: recursive directory loop
cs: smyèka pro rekurzivní prùchod
ro: buclã recursivã de directoare

source: Usage: %s [OPTION]... PATTERN [FILE]...
cs: Pou¾ití: %s [PØEPÍNAÈ]... VZOREK [SOUBOR]...
ro: Folosire: %s [OPÞIUNE]... TIPAR [FIªIER]...

source: Try `%s --help' for more information.
cs: Více informací získáte pøíkazem `%s --help'.
ro: Încercaþi `%s --help' pentru mai multe informaþii.

source: Usage: %s [OPTION]... PATTERN [FILE] ...
cs: Pou¾ití: %s [PØEPÍNAÈ]... VZOREK [SOUBOR]...
ro: Folosire: %s [OPÞIUNE]... TIPAR [FIªIER]...

source: Search for PATTERN in each FILE or standard input. Example: %s -i 'hello world' menu.h main.c Regexp selection and interpretation:
cs: Hledá øádky, jejich¾ nìkteré èásti vyhovují VZORKu. Øádky jsou èteny postupnì ze v¹ech zadaných SOUBORù nebo ze standardního vstupu. Pøíklad: %s -i 'hello world' menu.h main.c Výbìr a interpretace regulárního výrazu:
ro: Cautã dupã TIPAR în fiecare FIºIER sau de la intrare standard. Exemplu: %s -i 'hello world' menu.h main.c Selecþie ºi interpretare regexp:

source: -E, --extended-regexp PATTERN is an extended regular expression -F, --fixed-strings PATTERN is a set of newline-separated strings -G, --basic-regexp PATTERN is a basic regular expression -P, --perl-regexp PATTERN is a Perl regular expression
cs: -E, --extended-regexp VZOREK je roz¹íøený regulární výraz -F, --fixed-strings VZOREK je mno¾ina øetìzcù, ka¾dý na jednom øádku -G, --basic-regexp VZOREK je základní regulární výraz -P, --perl-regexp VZOREK je regulární výraz Perlu
ro: -E, --extended-regexp TIPAR este o expresie regulatã extinsã -F, --fixed-strings TIPAR este un set de ºiruri separate de linie_nouã -G, --basic-regexp TIPAR este o expresie exactã primarã -P, --perl-regexp TIPAR este o expresie exactã Perl

source: -e, --regexp=PATTERN use PATTERN as a regular expression -f, --file=FILE obtain PATTERN from FILE -i, --ignore-case ignore case distinctions -w, --word-regexp force PATTERN to match only whole words -x, --line-regexp force PATTERN to match only whole lines -z, --null-data a data line ends in 0 byte, not newline
cs: -e, --regexp=VZOREK pou¾ije VZOREK jako regulární výraz -f, --file=SOUBOR naète VZOREK ze SOUBORu -i, --ignore-case ignoruje rozdíl mezi velikostí písmen -w, --word-regexp VZOREK bude aplikován pouze na celá slova -x, --line-regexp VZOREK bude aplikován pouze na celé øádky -z, --null-data øádek konèí nulovým bajtem místo znaku nového øádku
ro: -e, --regexp=TIPAR foloseºte TIPAR ca expresie regulatã -f, --file=FIªIER obþine TIPAR din FIªIER -i, --ignore-case ignorã distincþille de caz(case) -w, --word-regexp forþeazã TIPAR sa corespundã doar cuvintelor întregi -x, --line-regexp forþeazã TIPAR sã corespundã doar liniilor întregi -z, --null-data linia de date se terminã în octet 0, nu linie_nouã

source: Miscellaneous: -s, --no-messages suppress error messages -v, --invert-match select non-matching lines -V, --version print version information and exit --help display this help and exit --mmap use memory-mapped input if possible
cs: Rùzné: -s, --no-messages potlaèí chybové zprávy -v, --invert-match vypí¹e øádky, které VZORKu nevyhovují -V, --version vypí¹e oznaèení verze a skonèí --help vypí¹e tuto nápovìdu a skonèí --mmap kdy¾ to jde, namapuje vstup do pamìti
ro: Diverse: -s, --no-messages suprimã mesajele de eroare -v, --invert-match selecteazã liniile necorespunzãtoare -V, --version tipãreºte informaþii versiune ºi terminã --help afiºeazã acest ajutor ºi terminã --mmap foloseºte intrare memory-mapped dacã e posibil

source: Output control: -m, --max-count=NUM stop after NUM matches -b, --byte-offset print the byte offset with output lines -n, --line-number print line number with output lines --line-buffered flush output on every line -H, --with-filename print the filename for each match -h, --no-filename suppress the prefixing filename on output --label=LABEL print LABEL as filename for standard input -o, --only-matching show only the part of a line matching PATTERN -q, --quiet, --silent suppress all normal output --binary-files=TYPE assume that binary files are TYPE TYPE is 'binary', 'text', or 'without-match' -a, --text equivalent to --binary-files=text -I equivalent to --binary-files=without-match -d, --directories=ACTION how to handle directories ACTION is 'read', 'recurse', or 'skip' -D, --devices=ACTION how to handle devices, FIFOs and sockets ACTION is 'read' or 'skip' -R, -r, --recursive equivalent to --directories=recurse --include=PATTERN files that match PATTERN will be examined --exclude=PATTERN files that match PATTERN will be skipped. --exclude-from=FILE files that match PATTERN in FILE will be skipped. -L, --files-without-match only print FILE names containing no match -l, --files-with-matches only print FILE names containing matches -c, --count only print a count of matching lines per FILE -Z, --null print 0 byte after FILE name
ro: Control ieºire (output)l: -m, --max-count=NUM oprire dupã NUM potriviri -b, --byte-offset tipãreºte locaþia (byte offset) cu liniile rezultate -n, --line-number tipãreºte numãrul liniei cu liniile rezultate --line-buffered înnoieºte (flush) outputul la fiecare linie -H, --with-filename tipãreºte numele de fiºier care corespund -h, --no-filename suprimã prefixarea cu nume de fiºier la output --label=ETICHETÃ tipãreºte ETICHETÃ ca nume fiºier pentru intrare standard -o, --only-matching afiºeazã doar o parte a unei linii corespunzãtoare TIPARului -q, --quiet, --silent suprimã tot outputul --binary-files=TiP presupune ca fiºierele binare sunt TIP unde TIP este 'binary', 'text', sau 'without-match' -a, --text echivalent cu --binary-files=text -I echivalent cu --binary-files=without-match -d, --directories=ACÞIUNE mod de manipulare al directoarelor ACÞIUNE este 'read', 'recurse', sau 'skip' -D, --devices=ACÞIUNE mod de manipulare device-uri, FIFOuri ºi sockeþi ACÞIUNE este 'read' sau 'skip' -R, -r, --recursive echivalent cu --directories=recurse --include=TIPAR fiºierele potrivite TIPARului vor fi examinate --exclude=TIPAR fiºierele potrivite TIPARului vor fi omise. --exclude-from=FIªIER fiºierele potrivite TIPARului în FIªIER vor fi omise. -L, --files-without-match afiºeazã doar nume FIªIERe care nu corespund -l, --files-with-matches afiºeazã doar nume FIªIERe care corespund -c, --count afiºeazã doar numãrul de potriviri per FIªIER -Z, --null tipãreºte octet 0 dupã nume FIªIER

source: Context control: -B, --before-context=NUM print NUM lines of leading context -A, --after-context=NUM print NUM lines of trailing context -C, --context=NUM print NUM lines of output context -NUM same as --context=NUM --color[=WHEN], --colour[=WHEN] use markers to distinguish the matching string WHEN may be `always', `never' or `auto'. -U, --binary do not strip CR characters at EOL (MSDOS) -u, --unix-byte-offsets report offsets as if CRs were not there (MSDOS) `egrep' means `grep -E'. `fgrep' means `grep -F'. With no FILE, or when FILE is -, read standard input. If less than two FILEs given, assume -h. Exit status is 0 if match, 1 if no match, and 2 if trouble.
ro: Control de context: -B, --before-context=NUM tipãreºte NUM linii dinainte de context -A, --after-context=NUM tipãreºte NUM linii de dupã context -C, --context=NUM tipãreºte NUM linii de context -NUM la fel ca ºi --context=NUM --color[=CÂND], --colour[=CÂND] foloseºte marcaje pentru a deosebi ºirurile potrivite CÂND poate fi `always', `never' sau `auto'. -U, --binary nu renunþa la caractere CR la EOL (MSDOS) -u, --unix-byte-offsets declarã offset ca ºi cum CR n-ar fi acolo(MSDOS) `egrep' înseamnã `grep -E'. `fgrep' înseamnã `grep -F'. Fãrã FIªIER, sau când FIªIER este -, se citeºte intrarea standard. Dacã se dau mai puþin de 2 FIªIERe, se presupune -h. Starea de ieºire e 0 pentru corespunzãtor, 1 pentru necorespunzãtor, ºi 2 pentru probleme.

source: conflicting matchers specified
cs: zadány kolidující vzorky
ro: conflicte între cãutãtorii (matchers) specificaþi

source: unknown devices method
ro: metodã dispozitive(devices) necunoscutã

source: unknown directories method
cs: neznámá obsluha adresáøù
ro: metodã directoare necunoscutã

source: invalid max count
cs: neplatný maximální poèet
ro: numãrare maximã invalidã

source: unknown binary-files type
cs: neznámý typ binárního souboru
ro: tip fiºiere-binare necunoscut

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
cs: Toto je volné programové vybavení; podmínky pro kopírování a roz¹iøování naleznete ve zdrojových textech. Toto programové vybavení je zcela BEZ ZÁRUKY, a to i bez záruky PRODEJNOSTI nebo VHODNOSTI PRO NÌJAKÝ KONKRÉTNÍ ÚÈEL.
ro: Acesta este software liber; vedeþi sursele pentru condiþii de copiere. NU existã nici o garanþie; nici mãcar pentru VANDABILITATE sau POTRIVIRE PENTRU UN SCOP ANUME.

source: The -P option is not supported
cs: Pøepínaè -P není podporován
ro: Opþiunea -P nu este suportatã

source: The -P and -z options cannot be combined
cs: Pøepínaèe -P a -z nemohou být kombinovány
ro: Opþiunile -P ºi -z nu pot fi combinate

source: Unknown system error
cs: Neznámá systémová chyba
ro: Eroare de sistem necunoscutã

source: %s: option `%s' is ambiguous
cs: %s: pøepínaè `%s' není jednoznaèný
ro: %s: opþiunea `%s' este ambiguã

source: %s: option `--%s' doesn't allow an argument
cs: %s: pøepínaè `--%s' musí být zadán bez argumentu
ro: %s: opþiunea `--%s' nu permite un parametru

source: %s: option `%c%s' doesn't allow an argument
cs: %s: pøepínaè `%c%s' musí být zadán bez argumentu
ro: %s: opþiunea `%c%s' nu permite un parametru

source: %s: option `%s' requires an argument
cs: %s: pøepínaè `%s' vy¾aduje argument
ro: %s: opþiunea `%s' necesitã un parametru

source: %s: unrecognized option `--%s'
cs: %s: neznámý pøepínaè `--%s'
ro: %s: opþiune necunoscutã `--%s'

source: %s: unrecognized option `%c%s'
cs: %s: neznámý pøepínaè `%c%s'
ro: %s: opþiune necunoscutã `%c%s'

source: %s: illegal option -- %c
cs: %s: neznámý pøepínaè -- %c
ro: %s: opþiune ilegalã -- %c

source: %s: invalid option -- %c
cs: %s: neznámý pøepínaè -- %c
ro: %s: opþiune invalidã -- %c

source: %s: option requires an argument -- %c
cs: %s: pøepínaè vy¾aduje argument -- %c
ro: %s: opþiunea necesitã un parametru -- %c

source: %s: option `-W %s' is ambiguous
cs: %s: pøepínaè `-W %s' není jednoznaèný
ro: %s: opþiunea `-W %s' este ambiguã

source: %s: option `-W %s' doesn't allow an argument
cs: %s: pøepínaè `-W %s' musí být zadán bez argumentu
ro: %s: opþiunea `-W %s' nu permite un parametru
